In [1]:
import numpy as np
import pandas as pd

# one_to_one_joins

In [2]:
df1=pd.DataFrame({'employee':['Raju','Rani','Ramesh','Ram'],
                 'group':['Accounting','Engineering','Engineering','HR']})
df2=pd.DataFrame({'employee':['Raju','Rani','Ramesh','Ram'],
                 'hire_date':[2004,2008,2012,2014]})

In [4]:
df1

  employee        group
0     Raju   Accounting
1     Rani  Engineering
2   Ramesh  Engineering
3      Ram           HR

In [5]:
df2

  employee  hire_date
0     Raju       2004
1     Rani       2008
2   Ramesh       2012
3      Ram       2014

In [6]:
df3=pd.merge(df1,df2)

In [7]:
df3

  employee        group  hire_date
0     Raju   Accounting       2004
1     Rani  Engineering       2008
2   Ramesh  Engineering       2012
3      Ram           HR       2014

In [9]:
df4=pd.concat([df1,df2],axis=0)

In [10]:
df4

  employee        group  hire_date
0     Raju   Accounting        NaN
1     Rani  Engineering        NaN
2   Ramesh  Engineering        NaN
3      Ram           HR        NaN
0     Raju          NaN     2004.0
1     Rani          NaN     2008.0
2   Ramesh          NaN     2012.0
3      Ram          NaN     2014.0

# Many_to_one_joins

In [11]:
df5=pd.DataFrame({'group':['Accounting','Engineering','HR'],
                 'supervisor':['Carly','Guido','Steve']})

In [12]:
df5

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

# many_to_many_joins

In [13]:
df6=pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],
                 'skills':['math','spreadsheets','coading','linux','spreadsheet','organization']})

In [14]:
df6

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering       coading
3  Engineering         linux
4           HR   spreadsheet
5           HR  organization

In [15]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0     Raju   Accounting       2004
1     Rani  Engineering       2008
2   Ramesh  Engineering       2012
3      Ram           HR       2014

In [16]:
data1=pd.DataFrame({'name':['mani','kanta','jyothi','asha','durga'],
                 'DOB':[1994,1994,1995,1992,1996],'age':[27,27,26,26,25]})

In [17]:
data2=pd.DataFrame({'name':['mani','kanta','jyothi','asha','durga'],
                 'Gender':['M','M','F','F','F'],'age':[27,27,26,26,25]})

In [18]:
data=pd.merge(data1,data2)

In [19]:
data

     name   DOB  age Gender
0    mani  1994   27      M
1   kanta  1994   27      M
2  jyothi  1995   26      F
3    asha  1992   26      F
4   durga  1996   25      F

In [22]:
da=pd.merge(data1,data2,on=['name','age'])

In [23]:
da

     name   DOB  age Gender
0    mani  1994   27      M
1   kanta  1994   27      M
2  jyothi  1995   26      F
3    asha  1992   26      F
4   durga  1996   25      F

# The left_on and right_on keywords

In [25]:
data1=pd.DataFrame({'employee':['mani','kanta','jyothi','asha','durga'],
                 'DOB':[1994,1994,1995,1992,1996],'age':[27,27,26,26,25]})

In [26]:
data2=pd.DataFrame({'name':['mani','kanta','jyothi','asha','durga'],
                 'Gender':['M','M','F','F','F'],'rank':[27,27,26,26,25]})

In [27]:
x=pd.merge(data1,data2, left_on='employee',right_on='name')

In [28]:
x

  employee   DOB  age    name Gender  rank
0     mani  1994   27    mani      M    27
1    kanta  1994   27   kanta      M    27
2   jyothi  1995   26  jyothi      F    26
3     asha  1992   26    asha      F    26
4    durga  1996   25   durga      F    25

In [29]:
x1=pd.merge(data1,data2, left_on='employee',right_on='name').drop('name',axis=1)

In [30]:
x1

  employee   DOB  age Gender  rank
0     mani  1994   27      M    27
1    kanta  1994   27      M    27
2   jyothi  1995   26      F    26
3     asha  1992   26      F    26
4    durga  1996   25      F    25

# left_index and right_index

In [35]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')

In [36]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                group  hire_date
employee
Raju       Accounting       2004
Rani      Engineering       2008
Ramesh    Engineering       2012
Ram                HR       2014

# join

In [37]:
df1a.join(df2a)

                group  hire_date
employee
Raju       Accounting       2004
Rani      Engineering       2008
Ramesh    Engineering       2012
Ram                HR       2014

# set arthmetic for joins

In [43]:
df6=pd.DataFrame({'name':['peter','paul','mary'],
                 'food':['fish','beans','bread']},columns=['name','food'])
df7=pd.DataFrame({'name':['mary','joseph','paul'],
                 'drink':['win','beer','water']},columns=['name','drink'])

In [44]:
pd.merge(df6,df7)

   name   food  drink
0  paul  beans  water
1  mary  bread    win

In [45]:
pd.merge(df6,df7,how='inner')

   name   food  drink
0  paul  beans  water
1  mary  bread    win

In [46]:
pd.merge(df6,df7,how='outer')

     name   food  drink
0   peter   fish    NaN
1    paul  beans  water
2    mary  bread    win
3  joseph    NaN   beer

In [47]:
pd.merge(df6,df7,how='left')

    name   food  drink
0  peter   fish    NaN
1   paul  beans  water
2   mary  bread    win

In [48]:
pd.merge(df6,df7,how='right')

     name   food  drink
0    paul  beans  water
1    mary  bread    win
2  joseph    NaN   beer

# overlapping columns names:the suffixes keyword

In [50]:
df8=pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],'rank':[1,2,3,4]})
df9=pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],'rank':[3,1,4,2]})

In [51]:
pd.merge(df8,df9,on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [52]:
pd.merge(df8,df9,on='name',suffixes=['_L','_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2